import React from "react";
import rfidbanner from '../../assets/images/rfidbanner.jpg'
import { Link } from "react-router-dom";
import "./AboutRFID.css";

export default function AboutRFID() {
  return (
      <>
      <div className="Container">
        <div>
          <img src={rfidbanner} alt="RFID Banner" className="rfid-banner" />
        </div>
          <div className="Container-text">
            <div className="Container1">
              <div className="Title">RFID СУУРЬ ОЙЛГОЛТ</div>
              <div className="whitetext">
                RFID системийг ашиглахын тулд бүтээгдэхүүн бүрийг чип бүхий шошгожуулсан байх шаардлагатай. Антентай холбогдсон энэхүү чип нь бараа материалын төрөл бүрийн шошгонуудтай холбогдож, тухайн бүтээгдэхүүний өвөрмөц EPC буюу электрон бүтээгдэхүүний код болон бусад мэдээллийг уншж  хянах боломжтой байдаг. 
              </div>
              <div className="whitetext">
               RFID уншигч нь суурин эсвэл хөдөлгөөнт төхөөрөмж байхаас үл хамаарч эдгээр шошготой антенаар дамжуулан холбогдож,  хадгалагдсан мэдээллийг шошгоруу тодорхой хэмжээний энерги илгээж ажиллуулдаг ба ингэснээр  өгөгдлийг системрүү илгээх боломжтой болдог. Уншигчид дараа нь гүүр болж, шошгоны өгөгдлийг бизнесийн програмуудад ашиглах боломжтой болгодог
              </div>
              <div className="lastwhitetext">
                Системийн гол цөм нь хэрэглээний программ хангамж бөгөөд шошго, уншигч, өгөгдөл зэрэг бүх бүрэлдэхүүн хэсгүүдийг нэгтгэдэг. Энэхүү программ хангамж нь өгөгдлийг боловсруулахад чухал ач холбогдолтой бөгөөд бизнесүүдэд бараа материалыг үр дүнтэй удирдах, хянах боломжийг олгож, RFID системийн цогц үйл ажиллагааг асуудалгүй хангах боломжийг бий болгодог.
              </div>
            </div>
            <div className="secTitle">RFID ШИЙДЭЛ НЬ ДАРААХ ХЭСГЭЭС БҮРДДЭГ :</div>
            <ul className="secwhitetext">
              <li>RFID шошго</li>
              <li>Уншигч төхөөрөмж</li>
              <li>Антенна</li>
              <li>Хэвлэгч төхөөрөмж</li>
              <li className="seclastwhitetext">Хэрэглээний програм хангамж</li>
            </ul>
            <div className="border">
            <div className="secTitle">RFID ШОШГО</div>
            <div className="secwhitetext">
              RFID шошго нь богино дамжуулаг (IC) гэж нэрлэгддэг жижиг чипээс болон<br />
              үүнтэй холбогдсон антеннаас бүрдэнэ. Энэхүү антенна нь ихэвчлэн <br />
              цаасан дээр эсвэл PET (полиэтилен терефталат) биет дээр суурилагдсан <br />
              байдаг. Чип болон антенны хослолыг inlay гэж нэрлэдэг. Дараа нь энэхүү <br />
              inlay-ыг хэвлэмэл шошго болон түүний наалдамхай дэвсгэр хоёрын <br />
              хооронд байрлуулж эсвэл зориулалтаас нь хамааран илүү бат бөх <br />
              бүтэцтэй болгон ашигладаг.
            </div>
            </div>
          </div>
        </div>
      </>
  );    
}